ddb-hedging/loadtest/Heavy-load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  
  target: http://localhost:8080/api

  payload:
    # path is relative to the location of the test script
    path: "{{ $processEnvironment.DATAFILE }}"
    fields:
      - "recordId"
      - "entityNumber"
    #order: sequence  
    #loadAll: true
    name: entity-records # refer to the data as "cc-auth"
    cast: false
  phases:
    - duration: 15
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 25
      name: Ramp up load
    - duration: 300
      arrivalRate: 5
      rampTo: 50
      name: Heavy load
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      #- loop:
          - post:
              url: "{{ $processEnvironment.REQUEST_URI }}"
              json:
                recordId: "{{ recordId }}"
                entityNumber: "{{ entityNumber }}"
        #over: entity-records